tutorials/multiRegion/CHT/heatExchanger/system/air/createZonesDict.2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      createZonesDict.2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rotor
{
    type        intersection;

    union
    {
        type        union;

        cylinder;
        innerCylinder;
    }

    box
    {
        type        box;
        zoneType    cell;

        box         (-100 -100 0.1) (100 100 0.15);
    }
}

// ************************************************************************* //
